app/controllers/items_controller.rb

  def index
    @items = Item.all # TODO Item.mine
---
SELECT "items".* FROM "items"

  def show
    @possible_match = Item.possible_match_for @item
    @like = Like.new
    #TODO @like.user =
    @like.user_item_id = @item.id
    @like.item_id = @possible_match.id
    @like.value = true
---
SELECT  "items".* FROM "items"  WHERE (id != 1)  ORDER BY "items"."id" ASC LIMIT 1

  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-11-27 17:29:23.341505"], ["name", "Voiture"], ["updated_at", "2014-11-27 17:29:23.341505"]]