app/controllers/likes_controller.rb

  def index
    @likes = Like.all
---
SELECT "likes".* FROM "likes"

  def create
    @like = Like.new(like_params)

    respond_to do |format|
      if @like.save
---
INSERT INTO "likes" ("created_at", "item_id", "updated_at", "user_item_id", "value") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-01-08 19:59:52.895272"], ["item_id", 3], ["updated_at", "2015-01-08 19:59:52.895272"], ["user_item_id", 2], ["value", "f"]]

    def set_like
      @like = Like.find(params[:id])
---
SELECT  "likes".* FROM "likes"  WHERE "likes"."id" = ? LIMIT 1  [["id", 1]]