app/controllers/matches_controller.rb

SELECT "matches".* FROM "matches"
---
  def index
    @matches = Match.all